## Chapter - 01 Data Preparation Basics

### Segment 3 - Removing Duplicates

In [1]:
import numpy as np 
import pandas as pd

from pandas import Series, DataFrame

### Removing Duplicates

In [2]:
df_obj = DataFrame({'Column 1': [1,1,2,2,3,3,3], 'Column 2': ['a','a','b','b','c','c','c'], 'Column 3': ['A','A','B','B','C','C','C']})
df_obj

   Column 1 Column 2 Column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [3]:
df_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [4]:
df_obj.drop_duplicates()

   Column 1 Column 2 Column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [6]:
df_obj = DataFrame({'Column 1': [1,1,2,2,3,3,3], 'Column 2': ['a','a','b','b','c','c','c'], 'Column 3': ['A','A','B','B','C','D','C']})
df_obj

   Column 1 Column 2 Column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [7]:
df_obj.drop_duplicates(['Column 3'])

   Column 1 Column 2 Column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         3        c        D

In [11]:
df_obj = DataFrame({'Column 1': [1,1,2,2,3,3,3], 'Column 2': ['a','a','b','b','c','c','c'], 'Column 3': ['A','A','B','B','C','D','C']})
df_obj

   Column 1 Column 2 Column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [12]:
df_obj.drop_duplicates(['Column 2'])

   Column 1 Column 2 Column 3
0         1        a        A
2         2        b        B
4         3        c        C